var hiragana_monograhps = [
	["あ", "い", "う", "え", "お"],
	["か", "き", "く", "け", "こ"],
	["さ", "し", "す", "せ", "そ"],
	["た", "ち", "つ", "て", "と"],
	["な", "に", "ぬ", "ね", "の"],
	["は", "ひ", "ふ", "へ", "ほ"],
	["ま", "み", "む", "め", "も"],
	["や", "", "ゆ", "", "よ"],
	["ら", "り", "る", "れ", "ろ"],
	["わ", "ゐ", "", "ゑ", "を"],
	["ん"]
];

var hiragana_diacritics = [
	["が", "ぎ", "ぐ", "げ", "ご"],
	["ざ", "じ", "ず", "ぜ", "ぞ"],
	["だ", "ぢ", "づ", "で", "ど"],
	["ば", "び", "ぶ", "べ", "ぼ"],
	["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"]
]

var hiragana_diagraphs = [
	["きゃ", "きゅ", "きょ"],
	["しゃ", "しゅ", "しょ"],
	["ちゃ", "ちゅ", "ちょ"],
	["にゃ", "にゅ", "にょ"],
	["ひゃ", "ひゅ", "ひょ"],
	["みゃ", "みゅ", "みょ"],
	["りゃ", "りゅ", "りょ"]
];

var hiragana_diagraphs_with_diacritics = [
	["ぎゃ", "ぎゅ", "ぎょ"],
	["じゃ", "じゅ", "じょ"],
	["ぢゃ", "ぢゅ", "ぢょ"],
	["びゃ", "びゅ", "びょ"],
	["ぴゃ", "ぴゅ", "ぴょ"]
]